{
    "version": "https://jsonfeed.org/version/1",
    "title": "EA1HET / 0x30.io",
    "description": "",
    "home_page_url": "https://0x30.io",
    "feed_url": "https://0x30.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Jonathan Gonzalez"
    },
    "items": [
        {
            "id": "https://0x30.io/application-security/",
            "url": "https://0x30.io/application-security/",
            "title": "Application Security",
            "summary": "A review on SAST, DAST, IAST and RASPIt’s estimated that 90 percent of security incidents result from attackers exploiting known software bugs. Needless to say, squashing those bugs in the development phase of software could reduce the information security risks facing many organizations today. To&hellip;",
            "content_html": "<h2 id=\"sast_dast_iast_and_rasp\" class=\"sectionedit2\">A review on SAST, DAST, IAST and RASP</h2>\n<div class=\"level2\">\n<p>It’s estimated that 90 percent of security incidents result from attackers exploiting known software bugs. Needless to say, squashing those bugs in the development phase of software could reduce the information security risks facing many organizations today. To do that, a number of technologies are available to help developers catch security flaws before they’re baked into a final software release. They include SAST, DAST, IAST, and RASP.</p>\n<h2 id=\"mcetoc_1dhl8k5f01\"><strong>SAST vs DAST</strong></h2>\n<p>SAST, or Static Application Security Testing, also known as “white box testing” has been around for more than a decade. It allows developers to find security vulnerabilities in the application source code earlier in the software development life cycle. It also ensures conformance to coding guidelines and standards without actually executing the underlying code.</p>\n<p>DAST, or Dynamic Application Security Testing, also known as “black box” testing, can find security vulnerabilities and weaknesses in a running application, typically web apps. It does that by employing fault injection techniques on an app, such as feeding malicious data to the software, to identify common security vulnerabilities, such as SQL injection and cross-­site scripting. DAST can also cast a spotlight in runtime problems that can’t be identified by static analysis­­ for example, authentication and server configuration issues, as well as flaws visible only when a known user logs in.</p>\n<h2 id=\"mcetoc_1dhl8khlv2\"><strong>SAST &amp; DAST Are Usually Used in Tandem </strong></h2>\n<p>SAST and DAST are often used in tandem because SAST isn’t going to find runtime errors and DAST isn’t going to flag coding errors, at least not down to the code line number. SAST performs well when it comes to finding an error in a line of code, such as weak random number generation, but usually not very efficient in finding data flow flaws. In addition, SAST solutions are notorious for the larger amount of false positive or false negatives. We created reshift, a free static security testing tool that uses our proprietary machine learning algorithm to triage false positives faster, check it out here if you are interested.</p>\n<p><em class=\"u\">Abstract Interpretation:</em> Some success in reducing or entirely eliminating false positives has been achieved with something called Abstract Interpretation. However, to get the best results, abstract interpretation algorithms need to be tailored to codes using an application’s domain, which includes its architecture, how it uses certain numerical algorithms and the types of data structures it manipulates.</p>\n<p><img src=\"https://notes.0x30.io/lib/exe/fetch.php?w=600&amp;tok=66fd04&amp;media=cybersec:dastvssast.jpeg\"></p>\n<div class=\"level2\">\n<p>Despite SAST’s imperfections, it remains a favorite among development teams. They like that it allows them to scan a project at the code level, which makes it easier for individual team members to make the changes recommended by the technology. it also lets them find flaws early in the development process, which helps reduce the costs and ripple effects that result from addressing problems at the end of the process.</p>\n<p>What’s more, SAST can be automated and transparently integrated into a project’s workflow. That removes some of the hassle typically associated with testing apps for security and contrasts sharply with DAST where, for large projects, a special infrastructure needs to be created, special tests performed and multiple instances of an application run in parallel with different input data.</p>\n<p>DAST, though, understands arguments and function calls so it can determine if a call is behaving as it should be. SAST can’t check calls and in most cases, is unable to check argument values.</p>\n</div>\n<h2 id=\"interactive_application_security_testing_iast\" class=\"sectionedit3\">Interactive Application Security Testing (IAST)</h2>\n<div class=\"level2\">\n<p>IAST or Interactive Application Security Testing. Because both SAST and DAST are older technologies, there are those who argue they lack what it takes to secure modern web and mobile apps. For example, SAST has a difficult time dealing with libraries and frameworks found in modern apps. That’s because static tools only see the application source code they can follow. What’s more, libraries and third­party components often cause static tools to choke, producing “lost sources” and “lost sinks” messages. The same is true for frameworks. Run a static tool on an <abbr title=\"Application Programming Interface\">API</abbr>, web service or REST endpoint, and it won’t find anything wrong in them because it can’t understand the framework.</p>\n<p>IAST is designed to address the shortcomings of SAST and DAST by combining elements of both approaches. IAST places an agent within an application and performs all its analysis in the app in real-time and anywhere in the development process ­­ IDE, continuous integrated environment, QA or even in production.</p>\n<p>Because the IAST agent is working inside the app, it can apply its analysis to the entire app ­­ all its code; its runtime control and data flow information; its configuration information; HTTP requests and responses; libraries, frameworks and other components; and backend connection information. Access to all that information allows the IAST engine to cover more code, produce more accurate results and verify a broader range of security rules than either SAST or DAST.</p>\n<figure class=\"post__video\"><iframe width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/5rxkEz7mjIk\" allowfullscreen=\"allowfullscreen\" ></iframe></figure>\n<p> </p>\n<h2 id=\"run-time_application_security_protection_rasp\" class=\"sectionedit4\">Run-time Application Security Protection (RASP)</h2>\n<div class=\"level2\">\n<p>RASP, or Run-time Application Security Protection As with IAST, RASP, or Run­time Application Security Protection, works inside the application, but it is less a testing tool and more a security tool. It’s plugged into an application or its run­time environment and can control application execution. That allows RASP to protect the app even if a network’s perimeter defenses are breached and the apps contain security vulnerabilities missed by the development team. RASP lets an app run continuous security checks on itself and respond to live attacks by terminating an attacker’s session and alerting defenders to the attack.</p>\n<p>An issue particular to RASP is it can create a sense of false security within a development team. They may not adhere to security best practices thinking, “If we miss something, RASP will pick it up.”</p>\n<p>The problem with technologies like IAST and RASP is they can have an adverse effect on application performance, although boosters of the tech any performance hits are minimal. An issue particular to RASP is it can create a sense of false security within a development team. They may not adhere to security best practices thinking, “If we miss something, RASP will pick it up.” But even if RASP finds a flaw, the development team still has to fix the problem and while they do, the application may have to be taken offline, costing an organization time, money and customer goodwill.</p>\n<p>Regardless of the challenges found in technologies like SAST, DAST, IAST and RASP, using them can create software that’s more secure and do it in a way that’s faster and more cost ­effective than tacking all security testing to the tail of the development process.</p>\n<figure class=\"post__video\"><iframe width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/5_9mEK_4nPg\" allowfullscreen=\"allowfullscreen\" ></iframe></figure>\n<p> </p>\n<h2 id=\"software_suites\" class=\"sectionedit5\">Software suites</h2>\n<h3 id=\"mcetoc_1dhl8nk3v3\" class=\"sectionedit5\">Static Application Security Testing</h3>\n<div class=\"level3\">\n<ol>\n<li class=\"level1 node\">\n<div class=\"li\"><em class=\"u\">Multilanguage</em></div>\n<ol>\n<li class=\"level2 node\">\n<div class=\"li\">OWASP</div>\n<ol>\n<li class=\"level3\">\n<div class=\"li\">SonarQube</div>\n</li>\n<li class=\"level3\">\n<div class=\"li\">FindBugs (Java, Groovy, Scala)</div>\n</li>\n<li class=\"level3\">\n<div class=\"li\">FindSecurityBugs (Java, Groovy, Scala)</div>\n</li>\n<li class=\"level3\">\n<div class=\"li\">LAPSE+ (J2EE)</div>\n</li>\n</ol>\n</li>\n<li class=\"level2\">\n<div class=\"li\">Veracode</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">Sparrow</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">Kiuwan</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">DefenseCode Thunderscan</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">MicroFocus Fortify</div>\n</li>\n</ol>\n</li>\n<li class=\"level1 node\">\n<div class=\"li\"><em class=\"u\">Language-specific</em>:</div>\n<ol>\n<li class=\"level2 node\">\n<div class=\"li\">Python</div>\n<ol>\n<li class=\"level3\">\n<div class=\"li\">Pylint</div>\n</li>\n</ol>\n</li>\n<li class=\"level2 node\">\n<div class=\"li\">Java, JS and derivatives</div>\n<ol>\n<li class=\"level3\">\n<div class=\"li\">JLint</div>\n</li>\n<li class=\"level3\">\n<div class=\"li\">Reshift</div>\n</li>\n</ol>\n</li>\n<li class=\"level2 node\">\n<div class=\"li\">PHP</div>\n<ol>\n<li class=\"level3\">\n<div class=\"li\">Pixy</div>\n</li>\n<li class=\"level3\">\n<div class=\"li\">PHP-Sat</div>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n</div>\n<h3 id=\"dynamic_application_security_testing\" class=\"sectionedit7\">Dynamic Application Security Testing</h3>\n<div class=\"level3\">\n<ol>\n<li class=\"level1 node\">\n<div class=\"li\"><em class=\"u\">Multilanguage</em>:</div>\n<ol>\n<li class=\"level2\">\n<div class=\"li\">IBM Rational AppScan</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">Sparrow</div>\n</li>\n</ol>\n</li>\n<li class=\"level1 node\">\n<div class=\"li\"><em class=\"u\">Language-specific</em>:</div>\n<ol>\n<li class=\"level2 node\">\n<div class=\"li\">Javascript:</div>\n<ol>\n<li class=\"level3\">\n<div class=\"li\">IROH.JS</div>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n</div>\n<h3 id=\"interactive_application_security_testing\" class=\"sectionedit8\">Interactive Application Security Testing</h3>\n<div class=\"level3\">\n<ol>\n<li class=\"level1\">\n<div class=\"li\">OWASP</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Sparrow</div>\n</li>\n</ol>\n</div>\n<h3 id=\"run-time_application_security_protection\" class=\"sectionedit9\">Run-time Application Security Protection</h3>\n<div class=\"level3\">\n<ol>\n<li class=\"level1\">\n<div class=\"li\">Contrast Security</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Sparrow</div>\n</li>\n</ol>\n</div>\n</div>\n</div>\n</div>",
            "author": {
                "name": "Jonathan Gonzalez"
            },
            "tags": [
            ],
            "date_published": "2019-08-07T07:27:41+02:00",
            "date_modified": "2019-08-07T07:28:05+02:00"
        },
        {
            "id": "https://0x30.io/cybersecurity-kill-chain/",
            "url": "https://0x30.io/cybersecurity-kill-chain/",
            "title": "CyberSecurity &#x27;Kill Chain&#x27;",
            "summary": "What is the Cyber Kill Chain Model?‘Kill Chain’ is a term originally used by the military to define the steps an enemy uses to attack a target. In 2011, Lockheed Martin released a paper defining a Cyber Kill Chain. Similar in concept to the military’s model, it defines&hellip;",
            "content_html": "<h3 id=\"mcetoc_1dhl89qlr0\">What is the Cyber Kill Chain Model?</h3>\n<p>‘Kill Chain’ is a term originally used by the military to define the steps an enemy uses to attack a target. In <a href=\"https://www.lockheedmartin.com/content/dam/lockheed/data/corporate/documents/LM-White-Paper-Intel-Driven-Defense.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">2011, Lockheed Martin released a paper</a> defining a Cyber Kill Chain. Similar in concept to the military’s model, it defines <strong>the steps used by cyber attackers in today’s cyber-based attacks</strong>. </p>\n<p>The theory is that by understanding each of these stages, defenders can better identify and stop attackers at each of the respective stages. The more points at which you can intercept the bad guys, the better the chance you have to deny them from their objective or force them to make enough noise where you can more easily detect them. </p>\n<p>The 'Kill Chain' model was developed by Lockheed Martin, named officially as the Cyber Kill Chain® framework, is part of the Intelligence Driven Defense® model for identification and prevention of cyber intrusions activity. The model identifies what the adversaries must complete in order to achieve their objective.</p>\n<p>The seven steps of the Cyber Kill Chain® enhance visibility into an attack and enrich an analyst’s understanding of an adversary’s tactics, techniques and procedures.</p>\n<p><code><strong>A: Advanced</strong></code><br><code><em>Targeted, Coordinated, Purposeful</em></code></p>\n<p><code><strong>P: Persistent</strong></code><br><code><em>Month after Month, Year after Year</em></code></p>\n<p><code><strong>T: Threat</strong></code><br><code><em>Person(s) with Intent, Opportunity, and Capability</em></code></p>\n<p><img src=\"https://notes.0x30.io/lib/exe/fetch.php?w=600&amp;tok=609fa9&amp;media=cybersec:the-cyber-kill-chain.png\"></p>",
            "author": {
                "name": "Jonathan Gonzalez"
            },
            "tags": [
            ],
            "date_published": "2019-08-07T07:23:56+02:00",
            "date_modified": "2019-08-07T07:24:23+02:00"
        },
        {
            "id": "https://0x30.io/databases-per-use-type/",
            "url": "https://0x30.io/databases-per-use-type/",
            "title": "Databases per use type",
            "summary": "The critical difference between NoSQL and Relational databases is that RDBMS schemas rigidly define how all data inserted into the database must be typed and composed, whereas NoSQL databases can be schema agnostic, allowing unstructured and semi-structured data to be stored and manipulated. NoSQL databases&hellip;",
            "content_html": "<div class=\"level1\">\n<p>The critical difference between NoSQL and Relational databases is that RDBMS schemas rigidly define how all data inserted into the database must be typed and composed, whereas NoSQL databases can be schema agnostic, allowing unstructured and semi-structured data to be stored and manipulated.</p>\n</div>\n<h2 id=\"nosql\" class=\"sectionedit2\">NoSQL</h2>\n<div class=\"level2\">\n<p>NoSQL databases emerged as a popular alternative to relational databases as web applications became increasingly complex.</p>\n<p><strong>Advantages</strong>: Since there are so many types and varied applications of NoSQL databases, it’s hard to nail these down, but generally:</p>\n<ul>\n<li class=\"level1\">\n<div class=\"li\">Schema-free data models are more flexible and easier to administer.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">NoSQL databases are generally more horizontally scalable and fault-tolerant.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">Data can easily be distributed across different nodes. To improve availability and/or partition tolerance, you can choose that data on some nodes be “eventually consistent”.</div>\n</li>\n</ul>\n<p><strong>Disadvantages</strong>: These are also dependent on the database type. Principally:</p>\n<ul>\n<li class=\"level1\">\n<div class=\"li\">NoSQL databases are generally less widely adopted and mature than RDBMS solutions, so specific expertise is often required.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">There are a range of formats and constraints specific to each database type.</div>\n</li>\n</ul>\n<p>NoSQL/Non-relational databases can take a variety of form:</p>\n</div>\n<h3 id=\"time-series_database\" class=\"sectionedit3\">Time-Series database</h3>\n<div class=\"level3\">\n<p><em>InfluxDB, AWS Timestream, Informix, Prometheus, Riak-TS, RRDTool, M3db, eXtreme</em></p>\n<p>A software implementation that is optimized for handling time series data, arrays of numbers indexed by time, a datetime or a datetime range. In some fields these time series are called profiles, curves, or traces. This kind of databases allows users to create, enumerate, update and destroy various time series and organize them. The server often supports a number of basic calculations that work on a series as a whole, such as multiplying, adding, or otherwise combining various time series into a new time serie. They can also filter on arbitrary patterns such as time ranges, low value filters, high value filters, or even have the values of one series filter another</p>\n</div>\n<h3 id=\"key-value_stores\" class=\"sectionedit4\">Key-Value Stores</h3>\n<div class=\"level3\">\n<p><em>Redis, AWS DynamoDB, Memcached, Aerospike, Riak-KV, Tarantool</em></p>\n<p>Are extremely simple database management systems that store only key-value pairs and provide basic functionality for retrieving the value associated with a known key. The simplicity of key-value stores makes these database management systems particularly well-suited to embedded databases, where the stored data is not particularly complex and speed is of paramount importance.</p>\n</div>\n<h3 id=\"wide_column_stores\" class=\"sectionedit5\">Wide Column Stores</h3>\n<div class=\"level3\">\n<p><em>Cassandra, Scylla, HBase</em></p>\n<p>Are schema-agnostic systems that enable users to store data in column families or tables, a single row of which can be thought of as a record, a multi-dimensional key-value store. These solutions are designed with the goal of scaling well enough to manage petabytes of data across as many as thousands of commodity servers in a massive, distributed system.</p>\n</div>\n<h3 id=\"document_stores\" class=\"sectionedit6\">Document Stores</h3>\n<div class=\"level3\">\n<p><em>MongoDB, Couchbase, CouchDB, Firebase,</em></p>\n<p>Are schema-free systems that store data in the form of JSON documents. Document stores are similar to key-value or wide column stores, but the document name is the key and the contents of the document, whatever they are, are the value. In a document store, individual records do not require a uniform structure, can contain many different value types, and can be nested. This flexibility makes them particularly well-suited to manage semi-structured data across distributed systems.</p>\n</div>\n<h3 id=\"graph_databases\" class=\"sectionedit7\">Graph Databases</h3>\n<div class=\"level3\">\n<p><em>Neo4J, Datastax</em></p>\n<p>Represent data as a network of related nodes or objects in order to facilitate data visualizations and graph analytics. A node or object in a graph database contains free-form data that is connected by relationships and grouped according to labels. Graph-Oriented Database Management Systems (DBMS) software is designed with an emphasis on illustrating connections between data points. As a result, graph databases are typically used when analysis of the relationships between heterogeneous data points is the end goal of the system, such as in fraud prevention, advanced enterprise operations, or Facebook’s original friends graph.</p>\n</div>\n<h2 id=\"sql_rdbms_relational\" class=\"sectionedit8\">SQL / RDBMS / Relational</h2>\n<div class=\"level2\">\n<p><em>MySQL, MariaDB, PostgreSQL, SQLite, Oracle, MS SQL Server, IBM DB2</em></p>\n<p>Relational databases emerged in the 70’s to store data according to a schema that allows data to be displayed as tables with rows and columns. RDBMS all provide functionality for reading, creating, updating, and deleting data, typically by means of Structured Query Language (SQL) statements. The tables in a relational database have keys associated with them, which are used to identify specific columns or rows of a table and facilitate faster access to a particular table, row, or column of interest.</p>\n<p>Data integrity is of particular concern in relational databases, and RDBMS use a number of constraints to ensure that the data contained in the tables is reliable and accurate.</p>\n<p><strong>Advantages</strong>:</p>\n<ul>\n<li class=\"level1\">\n<div class=\"li\">Relational databases are well-documented and mature technologies, and RDBMS are sold and maintained by a number of established corporations.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">SQL standards are well-defined and commonly accepted.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">A large pool of qualified developers have experience with SQL and RDBMS.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">All RDBMS are ACID-compliant, meaning they satisfy the requirements of Atomicity, Consistency, Isolation, and Durability.</div>\n</li>\n</ul>\n<p><strong>Disadvantages</strong>:</p>\n<ul>\n<li class=\"level1\">\n<div class=\"li\">RDBMS don’t work well (or at all) with unstructured or semi-structured data, due to schema and type constraints. This makes them ill-suited for large analytics or IoT event loads.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">The tables in your relational database will not necessarily map one-to-one with an object or class representing the same data.</div>\n</li>\n<li class=\"level2\">\n<div class=\"li\">When migrating one RDBMS to another, schemas and types must generally be identical between source and destination tables for migration to work (schema constraint). For many of the same reasons, extremely complex datasets or those containing variable-length records are generally difficult to handle with an RDBMS schema.</div>\n</li>\n</ul>\n</div>",
            "author": {
                "name": "Jonathan Gonzalez"
            },
            "tags": [
            ],
            "date_published": "2019-08-07T02:31:00+02:00",
            "date_modified": "2019-08-07T07:31:53+02:00"
        },
        {
            "id": "https://0x30.io/security-kpis/",
            "url": "https://0x30.io/security-kpis/",
            "title": "Security KPIs",
            "summary": "Building meaningful KPIs isn't an easy task. My experience with several Enterprise IT and security methodologies and frameworks is that, due to the fact the a) organisations are mostly immature in regard to security, and b) organisations want to have a security framework in place they can trust because&hellip;",
            "content_html": "<div class=\"level1\">\n<p>Building meaningful KPIs isn't an easy task.</p>\n<p>My experience with several Enterprise IT and security methodologies and frameworks is that, due to the fact the <em>a)</em> organisations are mostly immature in regard to security, and <em>b)</em> organisations want to have a security framework in place they can trust because they don't understand the full risk picture, involvement with fat frameworks, highly theoretical and difficult to develop in the practice, are very common specially if you think that no enough headcount is normally assigned to the security practice. With that in mind, we can/must simplify the security controls by revising the most necessary indicators, getting rid of those others that only mature organisations, from security angle, are ready to deliver.</p>\n<p>On the other hand, the framework or methodology to follow must be the most simplistic posible in order to streamline the control task, avoiding as much as posible the burden of the bureaucracy typically implemented on immature organisations as a result of false security sensation when, in fact, they are simply less developed organisations trying to overcome an difficult IT practice to control risks.</p>\n</div>\n<h2 id=\"control_objectives\" class=\"sectionedit2\">Control objectives</h2>\n<div class=\"level2\">\n<ol>\n<li class=\"level1\">\n<div class=\"li\">Cloud strategy</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Stakeholder communication plan</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Security cartography</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Documented shared responsibility model + RACI</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Security Operations playbook + Run-books + RACI</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Security epics plan / Director plan</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">Incident response simulation</div>\n</li>\n</ol>\n</div>\n<h2 id=\"measurement\" class=\"sectionedit3\">Measurement</h2>\n<h3 id=\"typology\" class=\"sectionedit4\">Typology</h3>\n<div class=\"level3\">\n<ul>\n<li class=\"level1\">\n<div class=\"li\">[U] –&gt; Unaddressed</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">[E] –&gt; Engaged</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">[C] –&gt; Completed</div>\n</li>\n</ul>\n</div>\n<h3 id=\"values\" class=\"sectionedit5\">Values</h3>\n<div class=\"level3\">\n<ul>\n<li class=\"level1\">\n<div class=\"li\">[U] –&gt; 0 or 'Not addressed'</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">[E] –&gt; 1 or 'Addressed in architecture and plans'</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">[E] –&gt; 2 or 'Minimal viable implementation'</div>\n</li>\n<li class=\"level1\">\n<div class=\"li\">[C] –&gt; 4 or 'Enterprise-ready production implementation'</div>\n</li>\n</ul>\n</div>",
            "author": {
                "name": "Jonathan Gonzalez"
            },
            "tags": [
            ],
            "date_published": "2019-08-07T01:30:00+02:00",
            "date_modified": "2019-08-07T07:30:35+02:00"
        }
    ]
}
